droneshire/ti/controlSUITE/device_support/f2802x/v221/f2802x_examples_drivers/sw_prioritized_interrupts/Example_2802xSWPrioritizedInterrupts.c
        // Prepare for the test:
        // Disable interrupts
        // Clear the trace buffer, PIE Control Register, CPU IER and IFR registers
        CPU_disableGlobalInts(myCpu);
        for(i = 0; i < 50; i++) ISRTrace[i] = 0;
        ISRTraceIndex = 0;
        PIE_clearAllFlags(myPie);
        PIE_clearAllFlags(myPie);
        CPU_disableInts(myCpu);
        CPU_clearIntFlags(myCpu);

        // Enable the PIE block
        PIE_enable(myPie);

        // Enable PIE group 2 interrupts 1-8
        PIE_enableInt(myPie, PIE_GroupNumber_2, (PIE_InterruptSource_e) 0x00FF);

        // Enable CPU INT2
        CPU_enableInt(myCpu, CPU_IntNumber_2);

        // Make sure PIEACK for group 2 is clear (default after reset)
        PIE_clearInt(myPie, PIE_GroupNumber_2);

        // Force all valid interrupts for Group 2
        PIE_forceInt(myPie, PIE_GroupNumber_2, (PIE_InterruptSource_e)(PIE_InterruptSource_TZ1
                | PIE_InterruptSource_TZ2 | PIE_InterruptSource_TZ3));

        // Enable Global interrupts
        CPU_enableGlobalInts(myCpu);


        // Wait for all group 2 interrupts to be serviced
        while(PIE_getIntFlags(myPie, PIE_GroupNumber_2) != 0x0000){
        }

        // Stop here and check the order the ISR's were serviced in the
        // ISRTrace
        __asm("        ESTOP0");


// CASE 3:
#elif (CASE==3)
//     Force all group 3 interrupts at once by writing to the PIEIFR3 register

        // Prepare for the test:
        // Disable interrupts
        // Clear the trace buffer, PIE Control Register, CPU IER and IFR registers
        CPU_disableGlobalInts(myCpu);
        for(i = 0; i < 50; i++) ISRTrace[i] = 0;
        ISRTraceIndex = 0;
        PIE_clearAllFlags(myPie);
        PIE_clearAllFlags(myPie);
        CPU_disableInts(myCpu);
        CPU_clearIntFlags(myCpu);

        // Enable the PIE block
        PIE_enable(myPie);

        // Enable PIE group 3 interrupts 1-8
        PIE_enableInt(myPie, PIE_GroupNumber_3, (PIE_InterruptSource_e) 0x00FF);

        // Make sure PIEACK for group 3 is clear (default after reset)
        PIE_clearInt(myPie, PIE_GroupNumber_3);

        // Enable CPU INT3
        CPU_enableInt(myCpu, CPU_IntNumber_3);

        // Force all valid interrupts for Group 3
        PIE_forceInt(myPie, PIE_GroupNumber_3, (PIE_InterruptSource_e) (PIE_InterruptSource_EPWM1
                | PIE_InterruptSource_EPWM2 | PIE_InterruptSource_EPWM3));

        // Enable Global interrupts
        CPU_enableGlobalInts(myCpu);

        // Wait for all group 3 interrupts to be serviced
        while(PIE_getIntFlags(myPie, PIE_GroupNumber_3) != 0x0000){
        }

        // Stop here and check the order the ISR's were serviced in the
        // ISRTrace
        __asm("        ESTOP0");

// CASE 4:
#elif (CASE==4)
//     Force all group 4 interrupts at once by writing to the PIEIFR4 register

        // Prepare for the test:
        // Disable interrupts
        // Clear the trace buffer, PIE Control Register, CPU IER and IFR registers
        CPU_disableGlobalInts(myCpu);
        for(i = 0; i < 50; i++) ISRTrace[i] = 0;
        ISRTraceIndex = 0;
        PIE_clearAllFlags(myPie);
        PIE_clearAllFlags(myPie);
        CPU_disableInts(myCpu);
        CPU_clearIntFlags(myCpu);

        // Enable the PIE block
        PIE_enable(myPie);

        // Enable PIE group 4 interrupts 1-8
        PIE_enableInt(myPie, PIE_GroupNumber_4, (PIE_InterruptSource_e) 0x00FF);
        

        // Make sure PIEACK for group 3 is clear (default after reset)
        PIE_clearInt(myPie, PIE_GroupNumber_4);
        

        // Enable CPU INT4
        CPU_enableInt(myCpu, CPU_IntNumber_4);

        // Force all valid interrupts for Group 4
        PIE_forceInt(myPie, PIE_GroupNumber_4, (PIE_InterruptSource_e) PIE_InterruptSource_ECAP1);

        // Enable Global interrupts
        CPU_enableGlobalInts(myCpu);

        // Wait for all group 4 interrupts to be serviced
        while(PIE_getIntFlags(myPie, PIE_GroupNumber_4) != 0x0000){
        }

        // Stop here and check the order the ISR's were serviced in the
        // ISRTrace
        __asm("        ESTOP0");


// CASE 5:
#elif (CASE==5)
//     Force all group 6 interrupts at once by writing to the PIEIFR6 register

        // Prepare for the test:
        // Disable interrupts
        // Clear the trace buffer, PIE Control Register, CPU IER and IFR registers
        CPU_disableGlobalInts(myCpu);
        for(i = 0; i < 50; i++) ISRTrace[i] = 0;
        ISRTraceIndex = 0;
        PIE_clearAllFlags(myPie);
        PIE_clearAllFlags(myPie);
        CPU_disableInts(myCpu);
        CPU_clearIntFlags(myCpu);

        // Enable the PIE block
        PIE_enable(myPie);

        // Enable PIE group 6 interrupts 1-8
        PIE_enableInt(myPie, PIE_GroupNumber_6, (PIE_InterruptSource_e) 0x00FF);

        // Make sure PIEACK for group 6 is clear (default after reset)
        PIE_clearInt(myPie, PIE_GroupNumber_6);

        // Enable CPU INT6
        CPU_enableInt(myCpu, CPU_IntNumber_6);

        // Force all valid interrupts for Group 6
        PIE_forceInt(myPie, PIE_GroupNumber_6, (PIE_InterruptSource_e) (PIE_InterruptSource_SPIARX
                | PIE_InterruptSource_SPIATX));

        // Enable Global interrupts
        CPU_enableGlobalInts(myCpu);


        // Wait for all group 6 interrupts to be serviced
        while(PIE_getIntFlags(myPie, PIE_GroupNumber_6) != 0x0000){
        }

        // Stop here and check the order the ISR's were serviced in the
        // ISRTrace
        __asm("        ESTOP0");

// CASE 6:
#elif (CASE==6)
//     Force all group 9 interrupts at once by writing to the PIEIFR4 register

        // Prepare for the test:
        // Disable interrupts
        // Clear the trace buffer, PIE Control Register, CPU IER and IFR registers
        CPU_disableGlobalInts(myCpu);
        for(i = 0; i < 50; i++) ISRTrace[i] = 0;
        ISRTraceIndex = 0;
        PIE_clearAllFlags(myPie);
        PIE_clearAllFlags(myPie);
        CPU_disableInts(myCpu);
        CPU_clearIntFlags(myCpu);

        // Enable the PIE block
        PIE_enable(myPie);

        // Enable PIE group 9 interrupts 1-8
        PIE_enableInt(myPie, PIE_GroupNumber_9, (PIE_InterruptSource_e) 0x00FF);

        // Make sure PIEACK for group 9 is clear (default after reset)
        PIE_clearInt(myPie, PIE_GroupNumber_9);

