droneshire/ti/controlSUITE/device_support/f2802x/v221/f2802x_examples_drivers/sw_prioritized_interrupts/Example_2802xSWPrioritizedInterrupts.c
        // Enable CPU INT9
        CPU_enableInt(myCpu, CPU_IntNumber_9);

        // Force all valid interrupts for Group 9
        PIE_forceInt(myPie, PIE_GroupNumber_9, (PIE_InterruptSource_e) (PIE_InterruptSource_SCIARX
                | PIE_InterruptSource_SCIATX));

        // Enable Global interrupts
        CPU_enableGlobalInts(myCpu);

        // Wait for all group 9 interrupts to be serviced
        while(PIE_getIntFlags(myPie, PIE_GroupNumber_9) != 0x0000){
        }

        // Stop here and check the order the ISR's were serviced in the
        // ISRTrace
        __asm("        ESTOP0");

// CASE 7:
#elif (CASE==7)
//     Force all group 1 and group 2 interrupts at once

        // Setup next test - fire interrupts from Group 1 and Group 2

        // Prepare for the test:
        // Disable interrupts
        // Clear the trace buffer, PIE Control Register, CPU IER and IFR registers
        CPU_disableGlobalInts(myCpu);
        for(i = 0; i < 50; i++) ISRTrace[i] = 0;
        ISRTraceIndex = 0;
        PIE_clearAllFlags(myPie);
        PIE_clearAllFlags(myPie);
        CPU_disableInts(myCpu);
        CPU_clearIntFlags(myCpu);

        // Enable the PIE block
        PIE_enable(myPie);

        // Enable PIE group 1 and group 2 interrupts 1-8
        PIE_enableInt(myPie, PIE_GroupNumber_1, (PIE_InterruptSource_e) 0x00FF);
        PIE_enableInt(myPie, PIE_GroupNumber_2, (PIE_InterruptSource_e) 0x00FF);

        // Make sure PIEACK for group 1 & 2 are clear (default after reset)
        PIE_clearInt(myPie, PIE_GroupNumber_1);
        PIE_clearInt(myPie, PIE_GroupNumber_2);

        // Enable CPU INT1 and INT2
        CPU_enableInt(myCpu, CPU_IntNumber_1);
        CPU_enableInt(myCpu, CPU_IntNumber_2);

        // Force all valid interrupts for Group 1 and from Group 2
        PIE_forceInt(myPie, PIE_GroupNumber_1, (PIE_InterruptSource_e)(PIE_InterruptSource_ADCINT_1_1
                | PIE_InterruptSource_ADCINT_1_2 | PIE_InterruptSource_XINT_1 | PIE_InterruptSource_XINT_2
                | PIE_InterruptSource_ADCINT_9 | PIE_InterruptSource_TIMER_0 | PIE_InterruptSource_WAKE));
        PIE_forceInt(myPie, PIE_GroupNumber_2, (PIE_InterruptSource_e)(PIE_InterruptSource_TZ1
                | PIE_InterruptSource_TZ2 | PIE_InterruptSource_TZ3));

        // Enable Global interrupts
        CPU_enableGlobalInts(myCpu);

        // Wait for all group 1 and group 2 interrupts to be serviced
        while(PIE_getIntFlags(myPie, PIE_GroupNumber_1) != 0x0000
                || PIE_getIntFlags(myPie, PIE_GroupNumber_2) != 0x0000){
        }

        // Check the ISRTrace to determine which order the ISR Routines completed
        __asm("        ESTOP0");

// CASE 8:
#elif (CASE==8)
//     Force all group 1 and group 2 and group 3 interrupts at once

        // Prepare for the test:
        // Disable interrupts
        // Clear the trace buffer, PIE Control Register, CPU IER and IFR registers
        CPU_disableGlobalInts(myCpu);
        for(i = 0; i < 50; i++) ISRTrace[i] = 0;
        ISRTraceIndex = 0;
        PIE_clearAllFlags(myPie);
        PIE_clearAllFlags(myPie);
        CPU_disableInts(myCpu);
        CPU_clearIntFlags(myCpu);

        // Enable the PIE block
        PIE_enable(myPie);

        // Enable PIE group 1, 2 and 3 interrupts 1-8
        PIE_enableInt(myPie, PIE_GroupNumber_1, (PIE_InterruptSource_e) 0x00FF);
        PIE_enableInt(myPie, PIE_GroupNumber_2, (PIE_InterruptSource_e) 0x00FF);
        PIE_enableInt(myPie, PIE_GroupNumber_3, (PIE_InterruptSource_e) 0x00FF);

        // Make sure PIEACK for group 1, 2 & 3 are clear (default after reset)
        PIE_clearInt(myPie, PIE_GroupNumber_1);
        PIE_clearInt(myPie, PIE_GroupNumber_2);
        PIE_clearInt(myPie, PIE_GroupNumber_3);

        // Enable CPU INT1, INT2 & INT3
        CPU_enableInt(myCpu, CPU_IntNumber_1);
        CPU_enableInt(myCpu, CPU_IntNumber_2);
        CPU_enableInt(myCpu, CPU_IntNumber_3);

        // Force all valid interrupts for Group1, 2 and 3
        PIE_forceInt(myPie, PIE_GroupNumber_1, (PIE_InterruptSource_e)(PIE_InterruptSource_ADCINT_1_1
                | PIE_InterruptSource_ADCINT_1_2 | PIE_InterruptSource_XINT_1 | PIE_InterruptSource_XINT_2
                | PIE_InterruptSource_ADCINT_9 | PIE_InterruptSource_TIMER_0 | PIE_InterruptSource_WAKE));
        PIE_forceInt(myPie, PIE_GroupNumber_2, (PIE_InterruptSource_e)(PIE_InterruptSource_TZ1
                | PIE_InterruptSource_TZ2 | PIE_InterruptSource_TZ3));
        PIE_forceInt(myPie, PIE_GroupNumber_3, (PIE_InterruptSource_e) (PIE_InterruptSource_EPWM1
                | PIE_InterruptSource_EPWM2 | PIE_InterruptSource_EPWM3));

        // Enable Global interrupts
        CPU_enableGlobalInts(myCpu);

        // Wait for all group 1 and group 2 and group 3 interrupts to be serviced
        while(PIE_getIntFlags(myPie, PIE_GroupNumber_1) != 0x0000
                || PIE_getIntFlags(myPie, PIE_GroupNumber_2) != 0x0000
                || PIE_getIntFlags(myPie, PIE_GroupNumber_3) != 0x0000){
        }

        // Check the ISRTrace to determine which order the ISR Routines completed
        __asm("        ESTOP0");

// CASE 9:
#elif (CASE==9)
//     Force all used PIE interrupts at once

        // Prepare for the test:
        // Disable interrupts
        // Clear the trace buffer, PIE Control Register, CPU IER and IFR registers
        CPU_disableGlobalInts(myCpu);
        for(i = 0; i < 50; i++) ISRTrace[i] = 0;
        ISRTraceIndex = 0;
        PIE_clearAllFlags(myPie);
        PIE_clearAllFlags(myPie);
        CPU_disableInts(myCpu);
        CPU_clearIntFlags(myCpu);

        // Enable the PIE block
        PIE_enable(myPie);

        // Enable all PIE group iterrupts 1-8
        PIE_enableInt(myPie, PIE_GroupNumber_1, (PIE_InterruptSource_e) 0x00FF);
        PIE_enableInt(myPie, PIE_GroupNumber_2, (PIE_InterruptSource_e) 0x00FF);
        PIE_enableInt(myPie, PIE_GroupNumber_3, (PIE_InterruptSource_e) 0x00FF);
        PIE_enableInt(myPie, PIE_GroupNumber_4, (PIE_InterruptSource_e) 0x00FF);
        PIE_enableInt(myPie, PIE_GroupNumber_6, (PIE_InterruptSource_e) 0x00FF);
        PIE_enableInt(myPie, PIE_GroupNumber_8, (PIE_InterruptSource_e) 0x00FF);
        PIE_enableInt(myPie, PIE_GroupNumber_9, (PIE_InterruptSource_e) 0x00FF);
        PIE_enableInt(myPie, PIE_GroupNumber_10, (PIE_InterruptSource_e) 0x00FF);
        PIE_enableInt(myPie, PIE_GroupNumber_12, (PIE_InterruptSource_e) 0x00FF);

        // Make sure PIEACK for group 1, 2, 3, 4, 6, 8, 9, 10, and 12 are clear (default after reset)
        PIE_clearInt(myPie, PIE_GroupNumber_1);
        PIE_clearInt(myPie, PIE_GroupNumber_2);
        PIE_clearInt(myPie, PIE_GroupNumber_3);
        PIE_clearInt(myPie, PIE_GroupNumber_4);
        PIE_clearInt(myPie, PIE_GroupNumber_6);
        PIE_clearInt(myPie, PIE_GroupNumber_8);
        PIE_clearInt(myPie, PIE_GroupNumber_9);
        PIE_clearInt(myPie, PIE_GroupNumber_10);
        PIE_clearInt(myPie, PIE_GroupNumber_12);

        // Enable CPU INT1, INT2, INT3, INT4, INT6, INT8, INT9, INT10, and INT12
        CPU_enableInt(myCpu, CPU_IntNumber_1);
        CPU_enableInt(myCpu, CPU_IntNumber_2);
        CPU_enableInt(myCpu, CPU_IntNumber_3);
        CPU_enableInt(myCpu, CPU_IntNumber_4);
        CPU_enableInt(myCpu, CPU_IntNumber_6);
        CPU_enableInt(myCpu, CPU_IntNumber_8);
        CPU_enableInt(myCpu, CPU_IntNumber_9);
        CPU_enableInt(myCpu, CPU_IntNumber_10);
        CPU_enableInt(myCpu, CPU_IntNumber_12);

        // Force all valid interrupts for all PIE groups
        PIE_forceInt(myPie, PIE_GroupNumber_1, (PIE_InterruptSource_e)(PIE_InterruptSource_ADCINT_1_1
                | PIE_InterruptSource_ADCINT_1_2 | PIE_InterruptSource_XINT_1 | PIE_InterruptSource_XINT_2
                | PIE_InterruptSource_ADCINT_9 | PIE_InterruptSource_TIMER_0 | PIE_InterruptSource_WAKE));
        PIE_forceInt(myPie, PIE_GroupNumber_2, (PIE_InterruptSource_e)(PIE_InterruptSource_TZ1
                | PIE_InterruptSource_TZ2 | PIE_InterruptSource_TZ3));
        PIE_forceInt(myPie, PIE_GroupNumber_3, (PIE_InterruptSource_e) (PIE_InterruptSource_EPWM1
                | PIE_InterruptSource_EPWM2 | PIE_InterruptSource_EPWM3));
        PIE_forceInt(myPie, PIE_GroupNumber_4, (PIE_InterruptSource_e) PIE_InterruptSource_ECAP1);
        PIE_forceInt(myPie, PIE_GroupNumber_6, (PIE_InterruptSource_e) (PIE_InterruptSource_SPIARX
                | PIE_InterruptSource_SPIATX));
        PIE_forceInt(myPie, PIE_GroupNumber_8, (PIE_InterruptSource_e) (PIE_InterruptSource_I2CA1
                | PIE_InterruptSource_I2CA2));
        PIE_forceInt(myPie, PIE_GroupNumber_9, (PIE_InterruptSource_e) (PIE_InterruptSource_SCIARX
                | PIE_InterruptSource_SCIATX));
        PIE_forceInt(myPie, PIE_GroupNumber_10, (PIE_InterruptSource_e) (PIE_InterruptSource_ADCINT_3
                | PIE_InterruptSource_ADCINT_4 | PIE_InterruptSource_ADCINT_5
                | PIE_InterruptSource_ADCINT_6 | PIE_InterruptSource_ADCINT_7
                | PIE_InterruptSource_ADCINT_8));
        PIE_forceInt(myPie, PIE_GroupNumber_12, (PIE_InterruptSource_e) PIE_InterruptSource_XINT_3);

        // Enable Global interrupts - CPU level
        CPU_enableGlobalInts(myCpu);

        // Wait for all group interrupts to be serviced
        while(PIE_getIntFlags(myPie, PIE_GroupNumber_1) != 0x0000
                || PIE_getIntFlags(myPie, PIE_GroupNumber_2) != 0x0000
                || PIE_getIntFlags(myPie, PIE_GroupNumber_3) != 0x0000
                || PIE_getIntFlags(myPie, PIE_GroupNumber_4) != 0x0000
                || PIE_getIntFlags(myPie, PIE_GroupNumber_5) != 0x0000
                || PIE_getIntFlags(myPie, PIE_GroupNumber_8) != 0x0000
                || PIE_getIntFlags(myPie, PIE_GroupNumber_9) != 0x0000
                || PIE_getIntFlags(myPie, PIE_GroupNumber_10) != 0x0000
                || PIE_getIntFlags(myPie, PIE_GroupNumber_12) != 0x0000){
        }
        // Check the ISRTrace to determine which order the ISR Routines completed
        __asm("        ESTOP0");
#endif
}

//===========================================================================
// No more.
//===========================================================================
